platforms/core-configuration/kotlin-dsl/README.md
```mermaid
C4Context
    title Context diagram for the Gradle Kotlin DSL
    Person(dev, "Developer", "Developer using a Kotlin DSL based Gradle build")

    System_Boundary(gradleBound, "Gradle Build Tool") {
        System(gradleKotlinDsl, "Kotlin DSL")
        System_Ext(buildCache, "Gradle Build Cache", "Local, Develocity Build Cache Node, etc...")
    }

    System_Boundary(jetbrains, "JetBrains") {
        System_Ext(ide, "IntelliJ IDE", "IDEA or Android Studio with the Kotlin plugin enabled")
        System_Ext(kotlinTools, "Kotlin Toolchain", "kotlinc, Gradle plugin etc...")
    }

    Rel(dev, gradleKotlinDsl, "Uses", "Command Line")
    Rel(dev, ide, "Uses", "GUI")
    Rel(gradleKotlinDsl, kotlinTools, "Uses")
    Rel(gradleKotlinDsl, buildCache, "Uses")
    Rel(ide, gradleKotlinDsl, "Uses", "Tooling API")
    Rel(ide, kotlinTools, "Uses")
    Rel(kotlinTools, buildCache, "Uses")
    UpdateLayoutConfig($c4ShapeInRow="1", $c4BoundaryInRow="2")
```
