platforms/core-configuration/kotlin-dsl/doc/c4/C4_1_Context.puml
@startuml
!include lib/C4_Context.puml

LAYOUT_TOP_DOWN

title Context diagram for the Gradle Kotlin DSL

Person(dev, "Developer", "Developer using a Kotlin DSL based Gradle build")

System_Ext(gradle, "Gradle Build Tool") {
    System(gradleKotlinDsl, "Kotlin DSL")
}

System_Ext(ide, "IntelliJ IDE", "IDEA or Android Studio with the Kotlin plugin enabled")

System_Ext(kotlinTools, "Kotlin Toolchain", "kotlinc, Gradle plugin etc...")

System_Ext(buildCache, "Gradle Build Cache", "Local, Develocity Build Cache Node, etc...")

Rel(dev, gradle, "Uses", "Command Line")
Rel(gradleKotlinDsl, kotlinTools, "Uses")
Rel(gradleKotlinDsl, buildCache, "Uses")

Rel(dev, ide, "Uses", "GUI")
Rel_U(ide, gradle, "Uses", "Tooling API")
Rel(ide, gradleKotlinDsl, "Uses")
Rel(ide, kotlinTools, "Uses")

Rel_Neighbor(kotlinTools, buildCache, "Uses")

@enduml
